import React from 'react';
import '../style/ShippingAndReturns.css';

export default function ShippingAndReturns() {
  return (
    <div className="shipping-container">
      <h2>🚚 الشحن والاسترجاع</h2>

      <section className="shipping-section">
        <h3>أولاً: معلومات الشحن</h3>
        <ul>
          <li>⏱ يتم توصيل الطلبات خلال 2 إلى 5 أيام عمل حسب المنطقة.</li>
          <li>💸 تكلفة الشحن تختلف حسب المحافظة وسيتم عرضها أثناء إتمام الطلب.</li>
          <li>🚛 يتم الشحن من خلال شركات موثوقة لضمان سلامة الطلب.</li>
          <li>🔍 يتم إرسال رقم تتبع بمجرد شحن الطلب عبر البريد الإلكتروني أو واتساب.</li>
        </ul>
      </section>

      <section className="shipping-section">
        <h3>ثانيًا: سياسة الاسترجاع والاستبدال</h3>
        <ul>
          <li>🔁 يمكنك طلب استرجاع أو استبدال خلال 14 يومًا من استلام الطلب.</li>
          <li>📦 يجب أن يكون المنتج بحالته الأصلية وغير مستخدم.</li>
          <li>🧾 يلزم وجود الفاتورة أو إثبات الشراء.</li>
          <li>🚫 المنتجات الشخصية مثل مستحضرات التجميل  لا تُسترجع بعد الفتح.</li>
          <li>📲 يمكنك طلب الاسترجاع بالتواصل معنا عبر صفحة "تواصل معنا" أو على واتساب.</li>
          <li>💸 يتحمل العميل رسوم الشحن والاسترجاع ما لم يكن هناك خطأ من طرفنا.</li>
        </ul>
      </section>
    </div>
  );
}
